---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailNumber
source: html/dcf0733e-51de-4d6c-740b-99d24fa08610.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailNumber Property

"Number"

## Syntax (C#)
```csharp
public static ForgeTypeId RepeatingDetailNumber { get; }
```